[
  "Aesop's Reverence Aromatique Hand Wash is more than just soap—it's a ritual of subtle luxury. It excels in combining elegant scent, gentle exfoliation, and skincare performance, all wrapped in a beautifully designed bottle. Ideal for those who appreciate aromatherapeutic experiences and aesthetic detail. However, the high price and exfoliating texture may not suit everyone—especially if your skin is very sensitive or you prefer minimalist scents. If you're seeking an elevated everyday indulgence and enjoy a woody-citrus aroma, this hand wash is an absolute delight and worth the splurge.",
  "Smells wonderful and feels smooth",
  "Amazing product! You only need a little. The scent is earthy and delivery was a snap!",
  "Nice. But pricey",
  "This is my second time purchasing. The smell is amazing and the soap is moisturizing.",
  "Love this brand and the resurrection in particular. You really need just to drop. So it lasts a long time you have a lingering fragrance that's pleasant and quite nice",
  "Great citrusy smell, if not a little strong. It is a chemical exfoliant with acidic so don't expect that pumice feel. Hands feel very hydrated after use.",
  "This hand wash smells amazing—earthy, woody, and clean without being overpowering. The exfoliating grit makes your hands feel super soft after every wash, and a little goes a long way. Instantly makes the bathroom feel more high-end. Definitely worth it if you want something that feels both functional and luxurious.",
  "I've been using Aesop Resurrection for a while now, and I honestly get the hype. It cleans really well without drying out my hands, which is hard to find—especially if you wash your hands often. The scent is subtle, fresh, and calming, not overpowering or artificial. A little goes a long way, so the bottle lasts longer than expected. It also leaves my hands feeling clean and moisturized without any sticky residue.",
  "Love it",
  "Lovely soap. Leaves hands smelling clean. This is my second bottle which tells me how much I like it.",
  "Soap that is a status symbol. I love both of the Aesop soaps I have, Resurrection and Reverence even at their astronomical price. The grit in the Reverence is perfect for the kitchen sink soap and the Resurrection is great for the bathroom. I actually wash my hands more because I love these soaps. The biggest disappointment the bottle is plastic. It should be glass, for the pricepoint, for the environment and for the luxury feel.",
  "Great aroma smell! So relaxation. Love it!",
  "Wow! I get the hype now. Fresh citrus/herbal scent. Luxurious",
  "Lathers well nice light scent softens hands could feel the difference",
  "Makes my hand smell like it does when I wash it in a hotel.",
  "Not worth the price in my opinion. Plastic bottle and the smell is not all that. Also it wasn't full, I'm thinking these might be watered down versions of the real thing",
  "I cannot get past the price tag and it comes in a plastic bottle?! For that reason alone, I'll splurge the $5 extra bucks and order flamingo estate. This stuff smells fine, but whatever! I am curious about their other flavors. The throw of this scent is up front but I don't smell it lingering on my hands after I rinse.",
  "There's no denying that Aesop's Reverence Aromatique Hand Wash smells incredible and feels luxurious — the earthy, woody scent and gentle exfoliating texture make washing your hands feel like a mini spa moment. The finely milled pumice does a great job of keeping hands soft and smooth. That said, the price is hard to justify. For what is ultimately a hand wash, it's extremely expensive, and the bottle doesn't last as long as you'd expect for the cost.",
  "Upon first receiving this I was shocked to see it was in a plastic bottle. For how much it costs I would have liked it to be a glass container. The smell is great but definitely not paying this steep price for some hand soap that comes in plastic.",
  "I just don't get it. It's fine hand soap, but for the price you would think it would age your hands backwards. I think there are better things to spend your money on.",
  "It came in a plastic bottle, the fragrance doesn't smell much",
  "Not one to do reviews but this brand is well marketed and people are living in fantasy land if they actually enjoy the sent. Resurrection is somewhat decent, I'd say bearable, slight orange smell that's earthy. Now reverence is by far the oddest thing I've smelt in a long time. I had to return it. It smelt so bad, it smells like a mix of lingering cigarettes along with you gardening all day.",
  "The resurrection is not good at all. It is advertised that one pump sufficient. However, when using the product, one pump was not sufficient to remove unpleasant smells from my soiled hands after washing. The reverance is an excellent product that is excellent at cleansing. I will only stick to the reverence and highly recommend staying away from the resurrection",
  "Has a stronger and different aroma than what I have experienced compared to buying it direct"
]
